module Narek where

import Graphics.Gloss.Data.Vector
import Graphics.Gloss.Geometry.Line
import Graphics.Gloss.Interface.Pure.Game
import Types

-- | Многоугольники, определяющие игрока.
playerPolygons :: Player -> [Path]
playerPolygons player = map (map move)
  [ [ (-800, -800), (-400, -800), (-400, -600), (-800, -600) ] , 
    [ (800, -800), (400, -800), (400, -600), (800, -600) ] ,     
    [ (-400, -800), (0, 400), (-200, 400), (-600, -800) ] ,      
    [ (400, -800), (0, 400), (200, 400), (600, -800) ] ,         
    [ (-200, 400), (200, 400), (200, 1600), (-200, 1600) ] ,     
    [ (-400, 1600), (400, 1600), (200, 1800), (-200, 1800) ] ,   
    [ (-100, 1800), (100, 1800), (100, 2000), (-100, 2000) ] ,   
    [ (600, 600), (800, 600), (400, 1600), (200, 1600) ] ,       
    [ (-600, 600), (-800, 600), (-400, 1600), (-200, 1600) ] ,   
    [ (-400, 2000), (400, 2000), (400, 2800), (-400, 2800) ]     
  ]
  where
    move (x, y) = (0, playerHeight player) + mulSV 0.03 (x, y)

